arieger2/ESP32-Treadmill-IDF-PlatformIO/src/ESP32_treadmill_tacho_wifi.cpp
// ============================================================================
// WiFi Management - State Machine Implementation
// Based on Espressif ESP-IDF WiFi Programming Guide best practices:
// - Active reconnect on disconnect (not relying on auto-reconnect)
// - User-initiated disconnect flag to prevent unwanted reconnects
// - Soft recovery before hard recovery (escalation)
// - IP_EVENT_STA_LOST_IP handling
// ============================================================================
#include "ESP32_treadmill_tacho_wifi.h"
#include "ESP32_treadmill_tacho_config.h"
#include <esp_wifi.h>
#include <esp_event.h>
#include <esp_netif.h>
#include <esp_coexist.h>
#include <esp_task_wdt.h>
#include <ESPmDNS.h>
#include <TimeLib.h>
#include <time.h>
#include <esp_sntp.h>

// External references
extern TreadmillMetrics metrics;
extern TreadmillStoredGlobals storedGlobals;
extern WiFiStatus wifi;

// Time sync globals
static bool gTimeSynced = false;
static uint32_t gLastTimeSyncAttemptMs = 0;

// User-initiated disconnect flag (per Espressif recommendation)
// Set this BEFORE calling esp_wifi_disconnect() or esp_wifi_stop()
static volatile bool gUserDisconnect = false;

// Reconnect backoff parameters
static const uint32_t RECONNECT_BASE_DELAY_MS = 1000;    // Start with 1 second
static const uint32_t RECONNECT_MAX_DELAY_MS = 30000;    // Max 30 seconds between attempts
static const uint8_t  SOFT_RESET_THRESHOLD = 3;          // After 3 fails: soft reset
static const uint8_t  HARD_RESET_THRESHOLD = 10;         // After 10 fails: hard reset

// WiFi State Machine Types
typedef enum {
    WIFI_STATE_INIT,
    WIFI_STATE_STA_CONNECTING,
    WIFI_STATE_STA_CONNECTED,
    WIFI_STATE_AP_MODE
} WiFiState_t;

typedef struct {
    WiFiState_t state;
    WiFiState_t previousState;
    uint32_t stateEnterTime;
    uint8_t connectionAttempts;
    uint8_t reconnectAttempts;        // Consecutive reconnect failures
    bool mdnsStarted;
    esp_netif_t* netif_sta;
    esp_netif_t* netif_ap;
    bool eventHandlersRegistered;
    uint32_t lastDisconnectTime;
    uint32_t lastReconnectAttempt;
    uint32_t reconnectBackoff;        // Current backoff delay
    bool wasConnected;
    bool hasIP;                       // Track L3 (IP) connectivity separately
    bool timeoutMessageShown;
    uint32_t initialConnectStartTime;
    bool stateEntered;                // Clean entry-action tracking
} WiFiManager_t;

static WiFiManager_t wifiMgr = {
    .state = WIFI_STATE_INIT,
    .previousState = WIFI_STATE_INIT,
    .stateEnterTime = 0,
    .connectionAttempts = 0,
    .reconnectAttempts = 0,
    .mdnsStarted = false,
    .netif_sta = nullptr,
    .netif_ap = nullptr,
    .eventHandlersRegistered = false,
    .lastDisconnectTime = 0,
    .lastReconnectAttempt = 0,
    .reconnectBackoff = RECONNECT_BASE_DELAY_MS,
    .wasConnected = false,
    .hasIP = false,
    .timeoutMessageShown = false,
    .initialConnectStartTime = 0,
    .stateEntered = false
};

// Forward declarations
static void wifiChangeState(WiFiState_t newState);
static void wifiStateMachine();
static void wifiInitSTA();
static void wifiInitAP();
static void wifiSoftReset();
static void wifiHardReset();
static void wifiTriggerReconnect(uint8_t reason);
static void wifi_event_handler(void* arg, esp_event_base_t event_base, int32_t event_id, void* event_data);
static void startMDNS();
static void syncTimeFromNetwork(bool force);

// ============================================================================
// State Management (clean entry-action pattern)
// ============================================================================
static void wifiChangeState(WiFiState_t newState) {
    if (wifiMgr.state == newState) return;
    
    const char* stateNames[] = {"INIT", "STA_CONNECTING", "STA_CONNECTED", "AP_MODE"};
    Serial.printf("📶 WiFi State: %s → %s\n", 
        stateNames[wifiMgr.state], stateNames[newState]);
    
    wifiMgr.previousState = wifiMgr.state;
    wifiMgr.state = newState;
    wifiMgr.stateEnterTime = millis();
    wifiMgr.stateEntered = false;  // Mark: entry-action not yet done
}

const char* wifiGetStateName() {
    const char* stateNames[] = {"INIT", "STA_CONNECTING", "STA_CONNECTED", "AP_MODE"};
    return stateNames[wifiMgr.state];
}

// ============================================================================
// Reconnect Helper - Per Espressif: Call esp_wifi_connect() on disconnect!
// ============================================================================
static void wifiTriggerReconnect(uint8_t reason) {
    // Skip if user-initiated disconnect (mode switch, etc.)
    if (gUserDisconnect) {
        Serial.println("  ↳ User-initiated disconnect, not reconnecting");
        return;
    }
    
    wifiMgr.reconnectAttempts++;
    
    // Calculate exponential backoff
    wifiMgr.reconnectBackoff = RECONNECT_BASE_DELAY_MS * (1 << min(wifiMgr.reconnectAttempts, (uint8_t)5));
    if (wifiMgr.reconnectBackoff > RECONNECT_MAX_DELAY_MS) {
        wifiMgr.reconnectBackoff = RECONNECT_MAX_DELAY_MS;
    }
    
    // Determine recovery strategy based on failure count
    if (wifiMgr.reconnectAttempts >= HARD_RESET_THRESHOLD) {
        Serial.printf("  ↳ Hard reset after %d failures\n", wifiMgr.reconnectAttempts);
        wifiHardReset();
    } else if (wifiMgr.reconnectAttempts >= SOFT_RESET_THRESHOLD) {
        Serial.printf("  ↳ Soft reset after %d failures\n", wifiMgr.reconnectAttempts);
        wifiSoftReset();
    } else {
        // Simple reconnect - per Espressif recommendation
        Serial.printf("  ↳ Reconnecting (attempt %d, backoff %lums)...\n", 
                      wifiMgr.reconnectAttempts, wifiMgr.reconnectBackoff);
        
        // Small delay for backoff (non-blocking would be better, but keep it simple)
        delay(min(wifiMgr.reconnectBackoff, (uint32_t)500));  // Max 500ms blocking
        
        esp_err_t ret = esp_wifi_connect();
        if (ret != ESP_OK) {
            Serial.printf("  ⚠️ esp_wifi_connect() failed: %s\n", esp_err_to_name(ret));
        }
    }
    
