arieger2/ESP32-Treadmill-IDF-PlatformIO/src/ESP32_treadmill_tacho_wifi.cpp
    wifiMgr.lastReconnectAttempt = millis();
}

// ============================================================================
// Soft Reset: stop + start (no deinit) - Per Espressif escalation pattern
// ============================================================================
static void wifiSoftReset() {
    Serial.println("  🔄 Soft reset: stop → start → connect");
    
    gUserDisconnect = true;  // Prevent event handler from reconnecting during reset
    
    esp_wifi_disconnect();
    delay(100);
    esp_wifi_stop();
    delay(200);
    esp_wifi_start();
    delay(100);
    
    gUserDisconnect = false;
    
    esp_err_t ret = esp_wifi_connect();
    if (ret != ESP_OK) {
        Serial.printf("  ⚠️ Soft reset connect failed: %s\n", esp_err_to_name(ret));
    }
}

// ============================================================================
// Hard Reset: Full re-init (deinit + init) - Last resort
// ============================================================================
static void wifiHardReset() {
    Serial.println("  🔄 Hard reset: full WiFi re-initialization");
    
    gUserDisconnect = true;
    
    // Deregister event handlers to avoid stale callbacks
    if (wifiMgr.eventHandlersRegistered) {
        esp_event_handler_unregister(WIFI_EVENT, ESP_EVENT_ANY_ID, &wifi_event_handler);
        esp_event_handler_unregister(IP_EVENT, IP_EVENT_STA_GOT_IP, &wifi_event_handler);
        esp_event_handler_unregister(IP_EVENT, IP_EVENT_STA_LOST_IP, &wifi_event_handler);
        wifiMgr.eventHandlersRegistered = false;
    }
    
    esp_wifi_disconnect();
    delay(100);
    esp_wifi_stop();
    delay(100);
    esp_wifi_deinit();
    delay(200);
    
    // Reset reconnect counter after hard reset
    wifiMgr.reconnectAttempts = 0;
    wifiMgr.reconnectBackoff = RECONNECT_BASE_DELAY_MS;
    
    gUserDisconnect = false;
    
    // Re-init via state machine
    wifiChangeState(WIFI_STATE_STA_CONNECTING);
}

// ============================================================================
// Event Handler - Per Espressif: actively reconnect on disconnect!
// ============================================================================
static void wifi_event_handler(void* arg, esp_event_base_t event_base, int32_t event_id, void* event_data) {
    if (event_base == WIFI_EVENT && event_id == WIFI_EVENT_STA_START) {
        Serial.println("  WiFi STA started, connecting...");
        esp_wifi_connect();
    } 
    else if (event_base == WIFI_EVENT && event_id == WIFI_EVENT_STA_DISCONNECTED) {
        wifi.connected = false;
        wifiMgr.hasIP = false;
        gTimeSynced = false;
        wifiMgr.lastDisconnectTime = millis();
        
        wifi_event_sta_disconnected_t* disconn_event = (wifi_event_sta_disconnected_t*) event_data;
        uint8_t reason = disconn_event->reason;
        
        // Get disconnect reason string and RSSI for debugging
        const char* reason_str = "Unknown";
        switch (reason) {
            case WIFI_REASON_UNSPECIFIED: reason_str = "UNSPECIFIED"; break;
            case WIFI_REASON_AUTH_EXPIRE: reason_str = "AUTH_EXPIRE"; break;
            case WIFI_REASON_AUTH_LEAVE: reason_str = "AUTH_LEAVE"; break;
            case WIFI_REASON_ASSOC_EXPIRE: reason_str = "ASSOC_EXPIRE"; break;
            case WIFI_REASON_ASSOC_TOOMANY: reason_str = "ASSOC_TOOMANY"; break;
            case WIFI_REASON_NOT_AUTHED: reason_str = "NOT_AUTHED"; break;
            case WIFI_REASON_NOT_ASSOCED: reason_str = "NOT_ASSOCED"; break;
            case WIFI_REASON_ASSOC_LEAVE: reason_str = "ASSOC_LEAVE"; break;
            case WIFI_REASON_ASSOC_NOT_AUTHED: reason_str = "ASSOC_NOT_AUTHED"; break;
            case WIFI_REASON_DISASSOC_PWRCAP_BAD: reason_str = "DISASSOC_PWRCAP_BAD"; break;
            case WIFI_REASON_DISASSOC_SUPCHAN_BAD: reason_str = "DISASSOC_SUPCHAN_BAD"; break;
            case WIFI_REASON_IE_INVALID: reason_str = "IE_INVALID"; break;
            case WIFI_REASON_MIC_FAILURE: reason_str = "MIC_FAILURE"; break;
            case WIFI_REASON_4WAY_HANDSHAKE_TIMEOUT: reason_str = "4WAY_HANDSHAKE_TIMEOUT"; break;
            case WIFI_REASON_GROUP_KEY_UPDATE_TIMEOUT: reason_str = "GROUP_KEY_UPDATE_TIMEOUT"; break;
            case WIFI_REASON_IE_IN_4WAY_DIFFERS: reason_str = "IE_IN_4WAY_DIFFERS"; break;
            case WIFI_REASON_GROUP_CIPHER_INVALID: reason_str = "GROUP_CIPHER_INVALID"; break;
            case WIFI_REASON_PAIRWISE_CIPHER_INVALID: reason_str = "PAIRWISE_CIPHER_INVALID"; break;
            case WIFI_REASON_AKMP_INVALID: reason_str = "AKMP_INVALID"; break;
            case WIFI_REASON_UNSUPP_RSN_IE_VERSION: reason_str = "UNSUPP_RSN_IE_VERSION"; break;
            case WIFI_REASON_INVALID_RSN_IE_CAP: reason_str = "INVALID_RSN_IE_CAP"; break;
            case WIFI_REASON_802_1X_AUTH_FAILED: reason_str = "802_1X_AUTH_FAILED"; break;
            case WIFI_REASON_CIPHER_SUITE_REJECTED: reason_str = "CIPHER_SUITE_REJECTED"; break;
            case WIFI_REASON_BEACON_TIMEOUT: reason_str = "BEACON_TIMEOUT"; break;
            case WIFI_REASON_NO_AP_FOUND: reason_str = "NO_AP_FOUND"; break;
            case WIFI_REASON_AUTH_FAIL: reason_str = "AUTH_FAIL"; break;
            case WIFI_REASON_ASSOC_FAIL: reason_str = "ASSOC_FAIL"; break;
            case WIFI_REASON_HANDSHAKE_TIMEOUT: reason_str = "HANDSHAKE_TIMEOUT"; break;
            case WIFI_REASON_CONNECTION_FAIL: reason_str = "CONNECTION_FAIL"; break;
            default: break;
        }
        
        // Log with additional debug info
        wifi_ap_record_t ap_info;
        int8_t rssi = -100;
        if (esp_wifi_sta_get_ap_info(&ap_info) == ESP_OK) {
            rssi = ap_info.rssi;
        }
        Serial.printf("  ⚠️ WiFi disconnected (reason: %d=%s, RSSI: %d)\n", reason, reason_str, rssi);
        
        // Per Espressif: ALWAYS call esp_wifi_connect() unless user-initiated!
        // This is the KEY FIX - don't rely on auto-reconnect!
        wifiTriggerReconnect(reason);
        
        // Update state if we were connected
        if (wifiMgr.state == WIFI_STATE_STA_CONNECTED) {
            wifiChangeState(WIFI_STATE_STA_CONNECTING);
        }
    } 
    else if (event_base == IP_EVENT && event_id == IP_EVENT_STA_GOT_IP) {
        ip_event_got_ip_t* event = (ip_event_got_ip_t*) event_data;
        wifi.connected = true;
        wifiMgr.hasIP = true;
        wifiMgr.connectionAttempts = 0;
        wifiMgr.reconnectAttempts = 0;  // Reset reconnect counter on success
        wifiMgr.reconnectBackoff = RECONNECT_BASE_DELAY_MS;
        wifiMgr.wasConnected = true;
        wifiMgr.mdnsStarted = false;
        wifiMgr.initialConnectStartTime = 0;
        Serial.printf("  ✅ Got IP: " IPSTR "\n", IP2STR(&event->ip_info.ip));
        wifiChangeState(WIFI_STATE_STA_CONNECTED);
    }
    // NEW: Handle IP loss (per Espressif recommendation)
    else if (event_base == IP_EVENT && event_id == IP_EVENT_STA_LOST_IP) {
        Serial.println("  ⚠️ Lost IP address (L3 down)");
        wifiMgr.hasIP = false;
        wifi.connected = false;  // Mark as not connected (no L3)
        // WiFi L2 might still be associated, but we can't communicate
        // Trigger DHCP renewal by disconnecting and reconnecting
        if (!gUserDisconnect) {
            Serial.println("  ↳ Triggering reconnect to renew DHCP...");
            esp_wifi_disconnect();
            delay(100);
            esp_wifi_connect();
        }
    }
    else if (event_base == WIFI_EVENT && event_id == WIFI_EVENT_AP_START) {
        Serial.println("  ✅ Access Point started");
        wifi.apMode = true;
    } 
    else if (event_base == WIFI_EVENT && event_id == WIFI_EVENT_AP_STACONNECTED) {
        wifi_event_ap_staconnected_t* event = (wifi_event_ap_staconnected_t*) event_data;
        Serial.printf("  📱 Client connected: " MACSTR "\n", MAC2STR(event->mac));
    } 
    else if (event_base == WIFI_EVENT && event_id == WIFI_EVENT_AP_STADISCONNECTED) {
        wifi_event_ap_stadisconnected_t* event = (wifi_event_ap_stadisconnected_t*) event_data;
        Serial.printf("  📱 Client disconnected: " MACSTR "\n", MAC2STR(event->mac));
    }
}

// ============================================================================
// mDNS Management
// ============================================================================
static void startMDNS() {
    MDNS.end();
    delay(100);
    
    if (MDNS.begin("treadmill")) {
        MDNS.addService("http", "tcp", 80);
        Serial.println("✅ mDNS started: http://treadmill.local/");
    } else {
        Serial.println("❌ mDNS failed");
    }
}

// ============================================================================
// Time Synchronization
// ============================================================================

// SNTP callback - fired by ESP-IDF SNTP task (not loop context), non-blocking
static void ntp_sync_callback(struct timeval *tv) {
    time_t now_t = tv->tv_sec;
    struct tm timeinfo;
    localtime_r(&now_t, &timeinfo);

    // Apply CET/CEST offset (tzset() already called before configTime)
    time_t local_time = now_t + 3600;
    if (timeinfo.tm_isdst > 0) {
        local_time += 3600;
    }
    setTime(local_time);
    gTimeSynced = true;
    Serial.printf("✅ NTP synced (UTC): %s", asctime(gmtime(&now_t)));
    Serial.printf("   Local (CET/CEST): %s", asctime(&timeinfo));
}

static void syncTimeFromNetwork(bool force) {
    const uint32_t now = millis();
    if (!force && (now - gLastTimeSyncAttemptMs < 60000)) {
        return;
    }
    gLastTimeSyncAttemptMs = now;

    Serial.println("Starting NTP sync (async)...");
    setenv("TZ", "CET-1CEST,M3.5.0,M10.5.0/3", 1);
    tzset();

    sntp_set_time_sync_notification_cb(ntp_sync_callback);
    configTime(0, 0, "pool.ntp.org", "time.nist.gov");
    // Returns immediately — ntp_sync_callback fires when SNTP task completes
}

// ============================================================================
// WiFi Initialization Functions
// Per Espressif: Avoid repeated deinit/init! Use soft reset first.
// ============================================================================
static void wifiInitSTA() {
    Serial.println("🔄 Initializing WiFi in Station mode...");
    
