arieger2/ESP32-Treadmill-IDF-PlatformIO/src/ESP32_treadmill_tacho_wifi.cpp
    gUserDisconnect = true;  // Prevent event handler interference during init
    
    esp_err_t ret;
    
    // Only do full cleanup if netif doesn't exist yet
    if (!wifiMgr.netif_sta) {
        // First time init or after hard reset
        esp_wifi_stop();
        delay(50);
        esp_wifi_deinit();
        delay(50);
        
        if (wifiMgr.netif_ap) {
            esp_netif_destroy(wifiMgr.netif_ap);
            wifiMgr.netif_ap = nullptr;
        }
        
        wifiMgr.netif_sta = esp_netif_create_default_wifi_sta();
        
        wifi_init_config_t cfg = WIFI_INIT_CONFIG_DEFAULT();
        ret = esp_wifi_init(&cfg);
        if (ret != ESP_OK) {
            Serial.printf("❌ WiFi init failed: %s\n", esp_err_to_name(ret));
            gUserDisconnect = false;
            wifiChangeState(WIFI_STATE_AP_MODE);
            return;
        }
    }
    
    // Register event handlers (including LOST_IP!)
    if (!wifiMgr.eventHandlersRegistered) {
        esp_event_handler_register(WIFI_EVENT, ESP_EVENT_ANY_ID, &wifi_event_handler, NULL);
        esp_event_handler_register(IP_EVENT, IP_EVENT_STA_GOT_IP, &wifi_event_handler, NULL);
        esp_event_handler_register(IP_EVENT, IP_EVENT_STA_LOST_IP, &wifi_event_handler, NULL);
        wifiMgr.eventHandlersRegistered = true;
    }
    
    ret = esp_wifi_set_mode(WIFI_MODE_STA);
    if (ret != ESP_OK) {
        Serial.printf("❌ Set mode failed: %s\n", esp_err_to_name(ret));
        gUserDisconnect = false;
        wifiChangeState(WIFI_STATE_AP_MODE);
        return;
    }
    
    wifi_config_t wifi_config = {};
    strncpy((char*)wifi_config.sta.ssid, storedGlobals.WIFI_SSID.c_str(), 
            sizeof(wifi_config.sta.ssid) - 1);
    strncpy((char*)wifi_config.sta.password, storedGlobals.WIFI_PASSWORD.c_str(), 
            sizeof(wifi_config.sta.password) - 1);
    
    // WPA2/WPA3 transition support with PMF for AUTH_EXPIRE fix
    // WIFI_AUTH_WPA2_WPA3_PSK accepts WPA2-only, WPA3-only, and WPA2/WPA3 transition APs
    wifi_config.sta.threshold.authmode = WIFI_AUTH_WPA2_WPA3_PSK;
    wifi_config.sta.pmf_cfg.capable = true;
    wifi_config.sta.pmf_cfg.required = false;
    
    // Default listen_interval (let ESP-IDF decide based on DTIM)
    // Setting to 1 can cause MORE issues with some APs
    wifi_config.sta.listen_interval = 0;  // 0 = use default
    
    ret = esp_wifi_set_config(WIFI_IF_STA, &wifi_config);
    if (ret != ESP_OK) {
        Serial.printf("❌ Config failed: %s\n", esp_err_to_name(ret));
        gUserDisconnect = false;
        wifiChangeState(WIFI_STATE_AP_MODE);
        return;
    }
    
    ret = esp_wifi_start();
    if (ret != ESP_OK) {
        Serial.printf("❌ Start failed: %s\n", esp_err_to_name(ret));
        gUserDisconnect = false;
        wifiChangeState(WIFI_STATE_AP_MODE);
        return;
    }
    
    // Configure BLE/WiFi coexistence
    esp_coex_preference_set(ESP_COEX_PREFER_BALANCE);
    
    // Power save: Use MIN_MODEM for BLE coexistence
    // Testing shows this is more stable than PS_NONE with BLE
    esp_wifi_set_ps(WIFI_PS_MIN_MODEM);
    
    gUserDisconnect = false;  // Now allow event handler to work
    
    Serial.printf("  Connecting to '%s'...\n", storedGlobals.WIFI_SSID.c_str());
    wifiMgr.connectionAttempts++;
}

static void wifiInitAP() {
    Serial.println("━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━");
    Serial.println("🔄 Initializing Access Point mode");
    Serial.println("━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━");
    
    gUserDisconnect = true;  // Prevent reconnect attempts during mode switch
    gTimeSynced = false;
    esp_err_t ret;
    
    esp_wifi_disconnect();
    delay(50);
    esp_wifi_stop();
    delay(50);
    esp_wifi_deinit();
    delay(50);
    
    if (wifiMgr.netif_sta) {
        esp_netif_destroy(wifiMgr.netif_sta);
        wifiMgr.netif_sta = nullptr;
    }
    
    if (!wifiMgr.netif_ap) {
        wifiMgr.netif_ap = esp_netif_create_default_wifi_ap();
        if (!wifiMgr.netif_ap) {
            Serial.println("❌ Failed to create AP netif");
            return;
        }
    }
    
    wifi_init_config_t cfg = WIFI_INIT_CONFIG_DEFAULT();
    ret = esp_wifi_init(&cfg);
    if (ret != ESP_OK) {
        Serial.printf("❌ WiFi init failed: %s\n", esp_err_to_name(ret));
        return;
    }
    
    if (!wifiMgr.eventHandlersRegistered) {
        esp_event_handler_register(WIFI_EVENT, ESP_EVENT_ANY_ID, &wifi_event_handler, NULL);
        wifiMgr.eventHandlersRegistered = true;
    }
    
    ret = esp_wifi_set_mode(WIFI_MODE_AP);
    if (ret != ESP_OK) {
        Serial.printf("❌ Set mode failed: %s\n", esp_err_to_name(ret));
        return;
    }
    
    wifi_config_t ap_config = {};
    const char* ssid = "treadmill_rieger";
    strncpy((char*)ap_config.ap.ssid, ssid, sizeof(ap_config.ap.ssid) - 1);
    ap_config.ap.ssid_len = strlen(ssid);
    ap_config.ap.channel = 1;
    ap_config.ap.max_connection = 4;
    ap_config.ap.authmode = WIFI_AUTH_OPEN;
    ap_config.ap.ssid_hidden = 0;
    ap_config.ap.beacon_interval = 100;
    
    ret = esp_wifi_set_config(WIFI_IF_AP, &ap_config);
    if (ret != ESP_OK) {
        Serial.printf("❌ Config failed: %s\n", esp_err_to_name(ret));
        return;
    }
    
    ret = esp_wifi_start();
    if (ret != ESP_OK) {
        Serial.printf("❌ Start failed: %s\n", esp_err_to_name(ret));
        return;
    }
    
    wifi.connected = false;
    wifi.apMode = true;
    wifiMgr.connectionAttempts = 0;
    wifiMgr.reconnectAttempts = 0;
    
    gUserDisconnect = false;  // Allow normal operation
    
    delay(300);
    
    Serial.println();
    Serial.println("━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━");
    Serial.println("✅ ACCESS POINT ACTIVE");
    Serial.println("━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━");
    Serial.println("  SSID: treadmill_rieger");
    Serial.println("  IP: 192.168.4.1");
    Serial.println("  Security: Open");
    Serial.println();
    Serial.println("📱 Connect to 'treadmill_rieger' and");
    Serial.println("   browse to http://192.168.4.1");
    Serial.println("━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━");
}

// ============================================================================
// State Machine - Clean entry-action pattern (no manual previousState setting)
// ============================================================================
static void wifiStateMachine() {
    const uint32_t now = millis();
    const uint32_t stateTime = now - wifiMgr.stateEnterTime;
    
    switch (wifiMgr.state) {
        case WIFI_STATE_INIT:
            // Entry action
            if (!wifiMgr.stateEntered) {
                wifiMgr.stateEntered = true;
                if (storedGlobals.WIFI_SSID.isEmpty()) {
                    Serial.println("📶 No WiFi credentials, starting AP mode");
                    wifiChangeState(WIFI_STATE_AP_MODE);
                } else {
                    Serial.println("📶 WiFi credentials found, connecting...");
                    wifiChangeState(WIFI_STATE_STA_CONNECTING);
                }
            }
            break;
            
        case WIFI_STATE_STA_CONNECTING:
            // Entry action
            if (!wifiMgr.stateEntered) {
                wifiMgr.stateEntered = true;
                if (wifiMgr.initialConnectStartTime == 0) {
                    wifiMgr.initialConnectStartTime = now;
                }
                wifiMgr.timeoutMessageShown = false;
                wifiInitSTA();
                wifiMgr.lastReconnectAttempt = now;
            }
            
            // Monitor for timeout (only for INITIAL connection, not reconnects)
            // Reconnects are handled by the event handler with backoff
            if (!wifiMgr.wasConnected) {
                const uint32_t totalConnectTime = now - wifiMgr.initialConnectStartTime;
                
