arieger2/ESP32-Treadmill-IDF-PlatformIO/src/ESP32_treadmill_tacho_wifi.cpp
                // Give up after 60 seconds on initial connection
                if (totalConnectTime >= 60000) {
                    if (!wifiMgr.timeoutMessageShown) {
                        Serial.printf("  ⏳ Initial connection failed after %lu seconds, switching to AP mode\n", totalConnectTime / 1000);
                        wifiMgr.timeoutMessageShown = true;
                    }
                    wifiChangeState(WIFI_STATE_AP_MODE);
                }
            }
            // For reconnects (wasConnected=true): event handler handles it with backoff
            // No timeout - keep trying indefinitely
            break;
            
        case WIFI_STATE_STA_CONNECTED:
            // Entry action
            if (!wifiMgr.stateEntered) {
                wifiMgr.stateEntered = true;
            }
            
            if (!wifiMgr.mdnsStarted) {
                startMDNS();
                wifiMgr.mdnsStarted = true;
            }
            if (!gTimeSynced && stateTime > 2000) {
                syncTimeFromNetwork(false);
            }
            break;
            
        case WIFI_STATE_AP_MODE:
            // Entry action
            if (!wifiMgr.stateEntered) {
                wifiMgr.stateEntered = true;
                wifiInitAP();
                wifiMgr.lastReconnectAttempt = now;
            }
            
            // Periodically try to reconnect to known network (every 5 minutes)
            if (wifiMgr.wasConnected && !storedGlobals.WIFI_SSID.isEmpty()) {
                const uint32_t timeSinceLastAttempt = now - wifiMgr.lastReconnectAttempt;
                if (timeSinceLastAttempt >= 300000) {
                    Serial.println("  📶 Attempting to reconnect to known network...");
                    wifiMgr.connectionAttempts = 0;
                    wifiMgr.reconnectAttempts = 0;
                    wifiChangeState(WIFI_STATE_STA_CONNECTING);
                }
            }
            break;
    }
}

// ============================================================================
// Public API
// ============================================================================
void wifiInit() {
    Serial.println("━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━");
    Serial.println("📶 WiFi Manager Initializing");
    Serial.println("━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━");
    
    esp_err_t ret = esp_netif_init();
    if (ret != ESP_OK && ret != ESP_ERR_INVALID_STATE) {
        ESP_ERROR_CHECK(ret);
    }
    
    ret = esp_event_loop_create_default();
    if (ret != ESP_OK && ret != ESP_ERR_INVALID_STATE) {
        ESP_ERROR_CHECK(ret);
    }
    
    wifi.attempts = 0;
    wifi.connected = false;
    wifi.apMode = false;
    wifiChangeState(WIFI_STATE_INIT);
    
    Serial.println("✅ WiFi Manager ready");
}

void wifiLoop() {
    static uint32_t lastRun = 0;
    const uint32_t now = millis();
    
    if (now - lastRun < 500) return;
    lastRun = now;
    
    // LED removed - no visual WiFi status indication
    wifiStateMachine();
}

void wifiForceAPMode() {
    Serial.println("⚠️  Forcing AP mode...");
    gUserDisconnect = true;  // Prevent reconnect attempts
    wifiChangeState(WIFI_STATE_AP_MODE);
}
